'''
- 표기법
1. 스네이크: 변수, 함수
2. 카멜: 클래스

- 파이썬 자료형
1. 정수 int
2. 소수(실수) float
2.5 복소수
3. 문자열
4. 부울: 오직 참(True, 1, YES, ON, ENABLE, 사용, 예)과 거짓(False, 0, NO, OFF, DISABLE, 사용안함, 아니오)만을 표현

- 데이터 구분
[ 대괄호] 리스트
{ 중괄호 } 딕셔너리 = map
( 소괄호 ) 튜플 - 괄호없이 선언하면 기본값, 한번 선언하면 변경못함 - 상수(파이)

-직접교환 
자바나 C에서는 temp에 담아야 하는데 
e = 3.5; f = 4.5
e, f = f, e 하면 동시에 교환이 일어난다

-집합 분배
a, b, c, d, *e = [1,2,3,4,5,6,1,2,3,4,5,6,2,3]
a => 1
b => 2
c => 3
d => 4
e => [5, 6, 1, 2, 3, 4, 5, 6, 2, 3]

'''

print("Hello, python")
print("김다솔")